results-shopcart-jvm/run_3_2026-01-05_01-17-42/FIXED-800-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.374ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.392ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.342ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.201ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.240ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.271ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.263ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.281ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.272ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.274ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.230ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.203ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.237ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.225ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.214ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.258ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.88ms  337.84us   7.02ms   66.10%
    Req/Sec    51.68     51.31   111.00     88.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.88ms
 75.000%    1.13ms
 90.000%    1.30ms
 99.000%    1.47ms
 99.900%    3.11ms
 99.990%    5.59ms
 99.999%    7.02ms
100.000%    7.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.117     0.000000            1         1.00
       0.469     0.100000         1605         1.11
       0.572     0.200000         3208         1.25
       0.675     0.300000         4797         1.43
       0.780     0.400000         6404         1.67
       0.883     0.500000         7992         2.00
       0.940     0.550000         8794         2.22
       0.992     0.600000         9598         2.50
       1.040     0.650000        10392         2.86
       1.085     0.700000        11206         3.33
       1.135     0.750000        11996         4.00
       1.161     0.775000        12398         4.44
       1.187     0.800000        12789         5.00
       1.212     0.825000        13190         5.71
       1.240     0.850000        13590         6.67
       1.270     0.875000        14000         8.00
       1.284     0.887500        14192         8.89
       1.299     0.900000        14396        10.00
       1.314     0.912500        14587        11.43
       1.333     0.925000        14798        13.33
       1.348     0.937500        14988        16.00
       1.356     0.943750        15094        17.78
       1.365     0.950000        15189        20.00
       1.375     0.956250        15295        22.86
       1.386     0.962500        15385        26.67
       1.399     0.968750        15493        32.00
       1.406     0.971875        15542        35.56
       1.414     0.975000        15590        40.00
       1.421     0.978125        15639        45.71
       1.432     0.981250        15685        53.33
       1.444     0.984375        15736        64.00
       1.451     0.985938        15762        71.11
       1.458     0.987500        15786        80.00
       1.468     0.989062        15814        91.43
       1.476     0.990625        15835       106.67
       1.490     0.992188        15860       128.00
       1.498     0.992969        15872       142.22
       1.505     0.993750        15885       160.00
       1.517     0.994531        15897       182.86
       1.528     0.995313        15911       213.33
       1.543     0.996094        15922       256.00
       1.552     0.996484        15928       284.44
       1.561     0.996875        15936       320.00
       1.579     0.997266        15941       365.71
       1.605     0.997656        15947       426.67
       1.644     0.998047        15953       512.00
       1.673     0.998242        15956       568.89
       1.789     0.998437        15960       640.00
       2.257     0.998633        15963       731.43
       2.789     0.998828        15966       853.33
       3.251     0.999023        15969      1024.00
       3.519     0.999121        15970      1137.78
       3.793     0.999219        15972      1280.00
       4.379     0.999316        15974      1462.86
       4.511     0.999414        15975      1706.67
       4.743     0.999512        15977      2048.00
       4.743     0.999561        15977      2275.56
       4.767     0.999609        15978      2560.00
       4.979     0.999658        15979      2925.71
       5.139     0.999707        15980      3413.33
       5.335     0.999756        15981      4096.00
       5.335     0.999780        15981      4551.11
       5.335     0.999805        15981      5120.00
       5.587     0.999829        15982      5851.43
       5.587     0.999854        15982      6826.67
       6.507     0.999878        15983      8192.00
       6.507     0.999890        15983      9102.22
       6.507     0.999902        15983     10240.00
       6.507     0.999915        15983     11702.86
       6.507     0.999927        15983     13653.33
       7.023     0.999939        15984     16384.00
       7.023     1.000000        15984          inf
#[Mean    =        0.885, StdDeviation   =        0.338]
#[Max     =        7.020, Total count    =        15984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24016 requests in 30.00s, 7.17MB read
Requests/sec:    800.47
Transfer/sec:    244.79KB